config.org
#+TITLE: Emacs Doom configuration
#+AUTHOR: Florian Schr枚dl (floscr)
#+PROPERTY: header-args :tangle yes
#+STARTUP: org-startup-folded: showall
#+BEGIN_SRC emacs-lisp
;; -*- lexical-binding: t -*-
#+END_SRC

* Configuration
** Required Packages

#+BEGIN_SRC elisp
(require 'dash)
(require 's)
#+END_SRC

*** Secrets

Config that I don't want to share with the world.

They will be stored in here:

#+BEGIN_SRC elisp
(setq secrets-file "~/.config/secrets.el")
#+END_SRC

And I will load them on system start:

#+BEGIN_SRC elisp
(defun floscr/load-secrets-file ()
  (if-let ((file (if (file-exists-p secrets-file) secrets-file)))
      (load-library file)))

(floscr/load-secrets-file)
#+END_SRC

** About

This is my emacs config for [[https://github.com/hlissner/doom-emacs][doom-emacs]].

#+BEGIN_SRC elisp
(setq user-full-name "Florian Schr枚dl")
#+END_SRC

** Essentials
*** Directories
#+BEGIN_SRC elisp
(defcustom downloads-dir "~/Downloads/"
  "Directory containing my downloads."
  :type 'string)

(defcustom screenshot-dir "~/Pictures/Screenshots"
  "Directory containing my screenshots."
  :type 'string)
#+END_SRC
** Utilities
*** Macros
**** Aliases
#+BEGIN_SRC elisp
(defalias '位 'lambda)
#+END_SRC
**** Template Literals
:PROPERTIES:
:SOURCE:   https://gist.github.com/cbowdon/012d623920bd28453bf8
:END:

#+BEGIN_SRC elisp :tangle no
(template "2 = <<(+ 1 1)>>")
#+END_SRC

#+RESULTS:
: 2 = 2

#+BEGIN_SRC elisp
(defmacro template (text)
  "Template literals"
  (let ((pattern "<<\\(.*?\\)>>"))
    ;; The regexp matches anything between delimiters, non-greedily
    (with-temp-buffer
      (save-excursion (insert text))
      (let ((matches '()))
        (while (re-search-forward pattern nil t)
          (push (match-string 1) matches)
          (replace-match "%s" t t))
        `(format ,(buffer-string) ,@(reverse (mapcar 'read matches)))))))
#+END_SRC
*** General Helpers
**** Noop
#+BEGIN_SRC elisp
(defun noop (args) nil)
#+END_SRC
**** Run JXA scripts
#+BEGIN_SRC elisp
(defun do-jxa-script (cmd)
  "Run a osx javascript automation script via bash"
  (shell-command-to-string
   (concat "osascript -l 'JavaScript' -e '" cmd "'")))
#+END_SRC
**** Eval and Replace sexp
:PROPERTIES:
:SOURCE:   https://emacsredux.com/blog/2013/06/21/eval-and-replace/
:END:

#+BEGIN_SRC elisp
(defun eval-and-replace-sexp ()
  "Replace the preceding sexp with its value."
  (interactive)
  (right-char) ;; Fix for normal mode
  (backward-kill-sexp)
  (condition-case nil
      (prin1 (eval (read (current-kill 0)))
             (current-buffer))
    (error (message "Invalid expression")
           (insert (current-kill 0)))))
#+END_SRC
**** Kill and Message
#+BEGIN_SRC elisp
(defun copy-message (x)
  "Executes kill-new but with a message log side effect"
  (kill-new x)
  (message "Copied to clipboard: %s" x))
#+END_SRC
**** Shuffle List
:PROPERTIES:
:SOURCE:   [[http://kitchingroup.cheme.cmu.edu/blog/2014/09/06/Randomize-a-list-in-Emacs/][Randomize a list in Emacs]]
:END:

#+BEGIN_SRC elisp
(defun swap-list-items (LIST el1 el2)
  "in LIST swap indices EL1 and EL2 in place"
  (let ((tmp (elt LIST el1)))
    (setf (elt LIST el1) (elt LIST el2))
    (setf (elt LIST el2) tmp)))

(defun -shuffle (LIST)
  "Shuffle the elements in LIST.
shuffling is done in place."
  (loop for i in (reverse (number-sequence 1 (1- (length LIST))))
        do (let ((j (random (+ i 1))))
             (swap-list-items LIST i j)))
  LIST)
#+END_SRC
*** Math on Numbers
#+BEGIN_SRC elisp
(defun math-on-number (f &optional num)
  "Read user input and apply with function f to the number at point"
  (let* ((x (thing-at-point 'number))
         (arithmetic-symbol (pcase f
                              ('+ "+")
                              ('- "-")
                              ('/ "/")
                              ('* "*")
                              (_ (error "Unknown function %s" f))))
         (readline (concat (number-to-string x) " " arithmetic-symbol " "))
         (y (or num (read-number readline)))
         (result (funcall f x y))
         (bounds (bounds-of-thing-at-point 'evil-WORD)))
    (delete-region (car bounds) (cdr bounds))
    (insert (format "%.02f" result))))

(defun +math|add-to-number ()
  (interactive)
  (math-on-number '+))

(defun +math|subtract-from-number ()
  (interactive)
  (math-on-number '-))

(defun +math|subtract-maran-vegan ()
  (interactive)
  (math-on-number '- 8.60))

(defun +math|divide-by-number ()
  (interactive)
  (math-on-number '/))

(defun +math|multiply-by-number ()
  (interactive)
  (math-on-number '*))
#+END_SRC
*** Toggle Window Dedicated
:PROPERTIES:
:SOURCE:   [[https://emacs.stackexchange.com/questions/2189/how-can-i-prevent-a-command-from-using-specific-windows][buffers - How can I prevent a command from using specific windows? - Emacs Stack Exchange]]
:END:

To lock a window you set the dedicaded flag on the window.

#+BEGIN_SRC elisp
(defun toggle-window-dedicated ()
  "Control whether or not Emacs is allowed to display another
buffer in current window."
  (interactive)
  (message
   (if (let (window (get-buffer-window (current-buffer)))
         (set-window-dedicated-p window (not (window-dedicated-p window))))
       "%s: Window locked!"
     "%s: Window unlocked!")
   (current-buffer)))
#+END_SRC
*** File Utilities
**** Get the last file in directory
:PROPERTIES:
:SOURCE:   https://stackoverflow.com/a/30886283
:END:

#+BEGIN_SRC elisp
(defun +file/latest-file-in-dir (path)
  (let ((e (f-entries path)))
    (car (sort e (lambda (a b)
                   (not (time-less-p (file-timestamp a)
                                     (file-timestamp b))))))))

(defun file-timestamp (f) (let ((attrs (file-attributes f))) (nth 5 attrs)))
#+END_SRC
**** Reveal in Finder

The regular ~+macos/reveal-in-finder~ in doom only opens the folder.
This fix opens the folder and selects the file.

#+BEGIN_SRC elisp
(defun +macos/reveal-in-finder ()
  "Reveal the current file in finder and select it"
  (interactive)
  (do-applescript (concat
                   "tell application \"Finder\"\n"
                   "    activate\n"
                   "    reveal POSIX file \"" (buffer-file-name) "\"\n"
                   "end tell")))
#+END_SRC
*** Hydras
**** Hydra Expand Region
:PROPERTIES:
:SOURCE:   https://www.reddit.com/r/emacs/comments/also27/second_trial_for_a_weekly_tipstricksetc_thread/efi7pbj/
:END:

Expand region using a hydra.
Double press ~v~ to enable.

#+BEGIN_SRC elisp
(defhydra hydra-expand-region ()
   "region: "
   ("f" er/mark-defun "defun")
   ("v" er/expand-region "expand")
   ("V" er/contract-region "contract"))

(evil-define-key 'visual 'global (kbd "v") #'hydra-expand-region/body)
#+END_SRC
** UI
*** System specific window modifications

Resize the window font size etc according to the system.
This will be disabled in terminal mode.

#+BEGIN_SRC elisp
(when (display-graphic-p)
#+END_SRC

#+BEGIN_SRC elisp
(defcustom my-default-frame-size nil
  "A cons cell of screen dimensions (width . height)"
  :type 'cons)

(defcustom osx-screen-reserved-y-space 48
  "How much of the screen is available when subtracting the
1. app title bar
2. menu bar"
  :type 'integer)

(defcustom osx-screen-reserved-x-space 12
  "How much of the screen is available when subtracting the
1. Window Border"
  :type 'integer)

(defun my-set-initial-frame-size (size)
  "Set the initial frame"
  (let* ((width (car size))
         (height (cdr size))
         (left (- (x-display-pixel-width) width)))
    (setq initial-frame-alist
          (append (list `(left . ,left)
                        `(width . ,width)
                        '(fullscreen . fullheight))
                  initial-frame-alist)))
  (setq my-default-frame-size size))

(defun my-frame-resize-width (width)
  "Set the frame WIDTH. Maximize the frame vertically (minus the osx reserver space)"
  (set-frame-width (selected-frame) width nil t)
  (set-frame-height (selected-frame) (- (x-display-pixel-height) osx-screen-reserved-y-space) nil t)
  (set-frame-position (selected-frame) (- (x-display-pixel-width) width osx-screen-reserved-x-space) 0))

(defun my-frame-resize-work-external ()
  "External Monitor at work"
  (interactive)
  (my-frame-resize-width 1410))

(cond
 ((--first (s-contains? it system-name) '("Florians-MBP" "Florians-MacBook-Pro"))
  (my-frame-resize-work-external)
  (setq-default line-spacing 0.3))
 ((string= system-name "Florians-iMac.local")
  (setq-default line-spacing 10)
  (setq default-line-spacing 10)
  (setq doom-font (font-spec :family "Menlo" :size 14)))
 ((string= system-name "Florians-MacBook-Air.local")
  (setq-default line-spacing 0.4)
  (setq initial-frame-alist
        (append (list '(left . 272)
                      '(width . 165)
                      '(fullscreen . fullheight))
                initial-frame-alist)))
 (t (setq-default line-spacing 0.15)))
#+END_SRC


#+BEGIN_SRC elisp
)
#+END_SRC

