config.org
*** Theme Toggle

Allows me to toggle quickly between two themes.

#+BEGIN_SRC elisp
(defconst light-theme 'doom-one)
(defconst dark-theme  'doom-one-light)

(defun +doom|toggle-theme ()
  "Toggle between light and dark themes."
  (interactive)
  (cond ((eq doom-theme dark-theme)
         (message "Toggling to light-theme: %s" light-theme)
         (setq doom-theme light-theme)
         (doom/reload-theme))
        ((eq doom-theme light-theme)
         (message "Toggling to dark-theme: %s" dark-theme)
         (setq doom-theme dark-theme)
         (doom/reload-theme))
        (t (message "Toggling theme is not possible. Theme is not currently light-theme (%s) or dark-theme (%s)." light-theme dark-theme))))
#+END_SRC
*** Scrolloff

Start scrolling X lines before the end of a screen.
Disable for terminal buffers, since there cane be issues completion/interactive
shell scripts.

#+BEGIN_SRC elisp
(setq
 scroll-conservatively 10
 scroll-margin 10)

(add-hook 'term-mode-hook (位! (setq-local scroll-margin 0)))
(add-hook 'ivy-mode-hook (位! (setq-local scroll-margin 0)))
#+END_SRC
*** Line Spacing

Change and reset line-spacing for all buffers.

#+BEGIN_SRC elisp
(defvar default-line-spacing 0.2)

(defun set-line-spacing (&optional spacing)
  "Set the line spacing
When no line spacing is given is the default-line-spacing"
  (if line-spacing
      (setq-default line-spacing (+ (or spacing default-line-spacing) line-spacing))
    (setq-default line-spacing (+ 0 default-line-spacing))))

(defun +ui|reset-line-spacing ()
  (interactive)
  (setq-default line-spacing nil))

(defun +ui|increase-line-spacing ()
  (interactive)
  (set-line-spacing))

(defun +ui|decrease-line-spacing ()
  (interactive)
  (set-line-spacing (- default-line-spacing)))

(evil-define-key 'normal 'global (kbd "]z") #'+line-spacing/step/body)

;;;###autoload (autoload '+common-lisp/macrostep/body "lang/common-lisp/autoload/hydras" nil nil)
(defhydra +line-spacing/step (:exit nil :hint nil :foreign-keys run)
  "
Macro Expansion
^^Definitions                           ^^Compiler Notes             ^^Stickers
^^^^^^
[_z_] Expand
[_Z_] Collapse
"
  ("z" +ui|increase-line-spacing)
  ("Z" +ui|decrease-line-spacing)
  ("q" noop :exit t))
#+END_SRC
*** Popups
#+BEGIN_SRC elisp
(after! org
  (set-popup-rule! "^\\*Org Agenda" :side 'right :size 0.55 :select t :modeline t :ttl nil :quit nil)
  (set-popup-rule! "^\\*Org Src" :ignore t)
  (set-popup-rule! "^\\*Org QL Search" :side 'bottom :size 0.5 :select t :modeline t :ttl nil))

(set-popup-rule! "^\\*helm" :vslot -100 :size 0.32 :ttl nil)
(set-popup-rule! "^\\*doom:scratch" :ignore t)

(set-popup-rule! "^\\*nodejs" :side 'right :size 0.55 :select t :modeline t :ttl nil)

(set-popup-rule! "^\\*compilation" :side 'right :size 0.5 :select t :modeline t :ttl nil)
#+END_SRC
*** (Visual) Fill Column
#+BEGIN_SRC elisp
(setq-default fill-column 110)
(setq visual-fill-column-width fill-column)

(setq visual-fill-column-center-text t
      visual-fill-column-width
      ;; take Emacs 26 line numbers into account
      (+ (if EMACS26+ 6 0) fill-column))
#+END_SRC
** Custom Packages
*** Birthday Messsage
#+BEGIN_SRC elisp
(setq birthday-slack-emojis '("" "" "" "" ""))

(defun birthday-msg (name &optional emojis)
  "Creates birthday string"
  (let ((emojis (or emojis (--> birthday-slack-emojis
                               (-shuffle it)
                               (-take 3 it)
                               (string-join it " ")))))
    (template "<<(reverse emojis)>> !! Happy Birthday <<name>> !! <<emojis>>")))

(defun birthday-msg|copy ()
  "Copies birthday string"
  (interactive)
  (--> (read-string "Name: ")
       (birthday-msg it)
       (copy-message it)))
#+END_SRC
*** Guitar Timer

I log my guitar learning into an org file that is formated like this.

#+BEGIN_SRC org :tangle no
| Date                   | Progression | Progressions |
| [2019-07-28 Sun 22:26] | A-D         |           12 |
#+END_SRC

This function starts a timer and after 60 seconds,
plays a sound and prompts me to insert my count.

#+BEGIN_SRC elisp
(setq +guitar-chords '("A" "D" "E")
      +guitar-beep  "/System/Library/Sounds/Glass.aiff"
      +guitar-timer-duration 60)

(defun +guitar/read-timer (from to)
  (let ((amount (read-string "Count: "))
        (timestamp (format-time-string "[%F %a %H:%M]" (current-time)))
        (progression (template "<<from>>-<<to>>")))
    (save-excursion
      (evil-insert-newline-above)
      (insert (concat "| " (s-join " | " (list timestamp progression amount))))
      (call-interactively #'org-cycle))
    (play-sound-file +guitar-beep)))

(defun +guitar|start-timer (&optional from to)
  "Start a timer for a chord progression."
  (interactive)
  (let ((from (or from (ivy-read "From: " +guitar-chords)))
        (to (or to (ivy-read "To: " +guitar-chords))))
    (run-with-timer +guitar-timer-duration nil #'+guitar/read-timer from to)))
#+END_SRC
** Package Config
*** Blimp
#+BEGIN_SRC elisp
(def-package! blimp
  :hook (image-mode-hook . blimp-mode))
#+END_SRC
*** Comint
**** Allow evil enter anywhere

Fix for comint mode, throwing an error when pressing enter in the middle of the line.

#+BEGIN_EXAMPLE
error in process filter: End of buffer
#+END_EXAMPLE

#+BEGIN_SRC elisp
(map! :map comint-mode-map
      :n "RET" (位! (comint-send-input nil t)))
#+END_SRC
*** Company
**** Config
***** Sort company by occurance
:PROPERTIES:
:SOURCE:   [[https://github.com/company-mode/company-mode/issues/52][{Proposal} Improve company-dabbrev candidate ordering 路 Issue #52 路 company-mode/company-mode]]
:END:
#+BEGIN_SRC elisp
(setq company-transformers '(company-sort-by-occurrence)
      company-idle-delay 0.5)
#+END_SRC
**** Functions
***** Company complete whole lines for all matching buffers

Complete a whole line with all lines from buffers matching the current major-mode.

#+BEGIN_SRC elisp
(defun floscr:buffer-list-with-modes (modes)
  "Get all buffers that match MODES"
  (--filter
   (with-current-buffer it (-contains? (doom-enlist modes) major-mode))
   (buffer-list)))

(defun floscr:buffer-list-with-major-mode ()
  "Get all buffers matching the current major-mode
Has built in aliases"
  (let ((javascript-modes (list 'rjsx-mode 'js2-mode)))
    (pcase major-mode
      ('rjsx-mode
       (floscr:buffer-list-with-modes javascript-modes))
      ('js2-mode
       (floscr:buffer-list-with-modes javascript-modes))
      (_
       (floscr:buffer-list-with-modes major-mode)))))

(defun +company/whole-lines-all-buffers (command &optional arg &rest ignored)
  "`company-mode' completion backend that completes whole-lines, akin to vim's
C-x C-l."
  (interactive (list 'interactive))
  (require 'company)
  (pcase command
    (`interactive (company-begin-backend '+company/whole-lines-all-buffers))
    (`prefix      (company-grab-line "^[\t\s]*\\(.+\\)" 1))
    (`candidates
     (all-completions
      arg
      (funcall (-compose
                #'-uniq
                #'-flatten
                (lambda (xs)
                  (--map (with-current-buffer it
                           (split-string
                            (replace-regexp-in-string
                             "^[\t\s]+" ""
                             (buffer-substring-no-properties (point-min) (point-max)))
                            "\\(\r\n\\|[\n\r]\\)" t)) xs)))
               (floscr:buffer-list-with-major-mode))))))
#+END_SRC

Bindings

#+BEGIN_SRC elisp
(map!
 (:prefix "C-x"
   :i "C-l" #'+company/whole-lines-all-buffers
   :i "C-." #'+company/whole-lines))
#+END_SRC

*** Dired
**** Config
***** Use gls

Use ~gls~ with dired which is way faster than osx ~ls~
Must enable =dired-k-human-readable= when =-h= flag is given.
Otherwise dired comes to a grinding halt on some sizes.

#+BEGIN_SRC elisp
(after!
  dired
  :config
  (when (and IS-MAC (locate-file "gls" exec-path))
    (setq dired-listing-switches "-la -h --group-directories-first"
          dired-k-human-readable t
          insert-directory-program "gls" dired-use-ls-dired t)))
#+END_SRC
***** Window targeting

When there are two visual splits with dired buffers.
~C~ will take the other window as the copy target.
The cursor has to be on the dired frame with the marked files.

#+BEGIN_SRC elisp
(setq dired-dwim-target t)
#+END_SRC

***** Ignore .bs.js
#+BEGIN_SRC elisp
(def-package! dired-x
  :after dired
  :config
  (setq dired-omit-files
        (concat dired-omit-files
                ;; Reason Compiled Files
                "\\|\\.bs.js$")))
#+END_SRC
***** Disable dired from opening files in a new window
#+BEGIN_SRC elisp
(put 'dired-find-alternate-file 'disabled nil)
#+END_SRC
**** Functions
***** Kill all dired buffers with ~Q~
#+BEGIN_SRC elisp
(defun +dired|kill-dired-buffers ()
  "Kills all dired buffers
Dired creates a buffer for every directory which it visits
Which is fine since you can easily switch between visited buffers
But at some time I want to purge those buffers"
  (interactive)
  (mapc (lambda (buffer)
          (when (eq 'dired-mode (buffer-local-value 'major-mode buffer))
            (kill-buffer buffer)))
        (buffer-list)))

(map! :when (featurep! :editor evil +everywhere)
      :after dired
      :map dired-mode-map
      :n "Q" #'+dired|kill-dired-buffers)
#+END_SRC
