config.el

(defun expand-org-file-names (xs)
  (mapcar (位 (x) (expand-file-name x org-directory)) xs))

(setq level-1-refile-targets (expand-org-file-names '("reading-list.org"
                                                      "cooking.org"
                                                      ;; "books.org"
                                                      "programming.org"
                                                      "shoppinglist.org")))

(setq max-level-2-refile-targets (expand-org-file-names '("Emacs.org"
                                                          "art.org"
                                                          "diary"
                                                          "games.org"
                                                          "hardware.org"
                                                          "home.org"
                                                          "inbox.org"
                                                          "mealplan.org"
                                                          "misc.org"
                                                          "movies.org"
                                                          "music.org"
                                                          "osx.org"
                                                          "personal.org"
                                                          "podcasts.org"
                                                          "projects.org"
                                                          "sleep.org"
                                                          "sports.org"
                                                          "travel.org"
                                                          "Work/work.org")))

(defun level-1-refile-targets () level-1-refile-targets)

(defun max-level-2-refile-targets () max-level-2-refile-targets)

(after! org
  :config
  (setq org-refile-targets (quote ((nil :maxlevel . 5)
                                   (max-level-2-refile-targets :maxlevel . 2)
                                   (level-1-refile-targets :level . 1)))
        org-agenda-refile org-agenda-files))

(setq +org-capture-frame-parameters
  `((name . "org-capture")
    (width . 120)
    (height . 35)
    (transient . t)))

(defun +org|add-created-date-property ()
  "Add DATE_CAPTURED property to the current item."
  (interactive)
  (org-set-property +org-created-property (format-time-string  "[%Y-%m-%d %a %H:%M]")))

(add-hook 'org-capture-before-finalize-hook '+org|add-created-date-property)

(defun org-capture-bookmark-pair ()
  (split-string (org-as-mac-chrome-get-frontmost-url) "::split::"))

(defun org-capture-bookmark-string-url ()
  (car (org-capture-bookmark-pair)))

(defun org-capture-bookmark-string-description ()
  (cadr (org-capture-bookmark-pair)))

(after! org
  :config
  (setq org-capture-templates
        `(("t" "todo" entry
           (file org-default-notes-file)
           "* TODO %?")

          ("c" "Calendar Event" entry
           (file+headline ,(concat org-directory "/home.org") "Calendar")
           "* %?")

          ("e" "Emacs Todo" entry
           (file+headline ,(concat org-directory "/emacs.org") "Emacs Todos")
           "* TODO %?")

          ("p" "Pin Bookmark" entry (file+headline org-pinboard-file "Pinboard")
           "* %(org-capture-bookmark-string-description)%?\n:PROPERTIES:\n:URL:  %(org-capture-bookmark-string-url)\n:TIME: %U\n:END:")

          ("rr" "Add to reading list" entry (file+headline +org-reading-list-file "Reading List")
           "* TODO %(org-mac-chrome-get-frontmost-url)%?")

          ("rw" "Add to watching list" entry (file+headline +org-reading-list-file "Watching List")
           "* TODO %(org-mac-chrome-get-frontmost-url)%?")

          ("C" "Browser" entry
           (file org-default-notes-file)
           "* TODO %(org-mac-chrome-get-frontmost-url)%?")

          ("ww" "Work Task" entry
           (file+headline ,(concat org-directory "/Work/work.org") "Work Todos")
           "* TODO %?")

          ("wr" "Work Review" entry
           (file+headline ,(concat org-directory "/Work/work.org") "Work Todos")
           "* TODO %(+org/mac-chrome-get-frontmost-url-custom-format)%? :REVIEW: "))))

(map! :leader (:desc "Notes" :prefix "n"
                :desc "Pinboard File"             "B"  (位! (find-file org-pinboard-file))
                :desc "Save All Org Buffers"      "S"  #'org-save-all-org-buffers
                :desc "Agenda"                    "a"  #'org-agenda
                :desc "Search Pinboard"           "b"  #'helm-org-pinboard
                (:prefix-map ("c" . "clock")
                  :desc "Clock In"                "c"  #'org-clock-in
                  :desc "Clock Out"               "C"  #'org-clock-out
                  :desc "Mark Default Task"       "d"  #'org-clock-mark-default-task
                  :desc "Modify Effort Estimate"  "e"  #'org-clock-modify-effort-estimate
                  :desc "Clock In Last"           "l"  #'org-clock-in-last
                  :desc "Goto Current"            "g"  #'org-clock-goto
                  :desc "Goto Select"             "G"  (位! (org-clock-goto 'select))
                  :desc "Cancel"                  "x"  #'org-clock-cancel
                  :desc "Timestamp Up"            "="  #'org-clock-timestamps-up
                  :desc "Timestamp Down"          "-"  #'org-clock-timestamps-down)
                :desc "Emacs"                     "e"  (位! (find-file (concat org-directory "/Emacs.org")))
                :desc "Home"                      "h"  (位! (find-file (concat org-directory "/home.org")))
                :desc "Inbox"                     "i"  (位! (find-file (concat org-directory "/inbox.org")))
                :desc "Reading List"              "r"  #'+org-reading-list/org-open-reading-list-file
                :desc "Work"                      "w"  (位! (find-file (concat org-directory "/Work/work.org")))
                :desc "Store Link"                "y"  #'org-store-link))

(after! org
