config.el
  (map! :map evil-org-mode-map
        :n "s-j" #'org-move-subtree-down
        :n "s-k" #'org-move-subtree-up

        :localleader
        :desc "Archive Subtree"          :m "a" #'org-archive-subtree
        :desc "Archive Subtree and Done" :m "A" #'+org|archive-and-done
        :desc "Paste Chrome Link"        :m "p" #'+org|paste-chrome-link
        :desc "Grab tabs"                :m "P" #'+org|grab-chrome-tabs
        :desc "Cut Subtree"              :m "C" #'org-cut-subtree
        :desc "Paste Subtree"            :m "P" #'org-paste-subtree
        :desc "Sort Entries"             :m "S" #'+org|sort-entries

        :desc "Create/Edit Todo"  :nve "o" #'org-todo
        :desc "Schedule"          :nve "s" #'org-schedule
        :desc "Deadline"          :nve "d" #'org-deadline
        :desc "Refile"            :nve "r" #'org-refile
        :desc "Filter"            :nve "f" #'org-match-sparse-tree
        :desc "Tag heading"       :nve "t" #'org-set-tags-command

        (:desc "Attach" :prefix "F"
          :desc "Downloads File" :m "d" '+org-attach/downloads-file
          :desc "Screenshot" :m "s" '+org-attach/last-screenshot
          :desc "URI" :m "u" '+org-attach/uri
          :desc "File" :m "f" '+org-attach/file)

        (:desc "Insert" :prefix "i"
          :desc "Subheadeing" :m "s" (位!
                                      (call-interactively 'org-insert-subheading)
                                      (evil-insert-state))
          :desc "Inavtive Timestamp" :m "i" 'org-time-stamp-inactive)
        (:desc "Narrow" :prefix "n"
          :desc "Indirect Buffer Tree" :m "i" #'org-tree-to-indirect-buffer
          :desc "Subtree"              :m "s" #'org-narrow-to-subtree
          :desc "Block"                :m "b" #'org-narrow-to-block
          :desc "Element"              :m "e" #'org-narrow-to-element
          :desc "widen"                :m "w" #'widen)))

(after! org-agenda
  (setq-default
   org-agenda-cmp-user-defined #'+org|compare-created-date-property
   org-agenda-sorting-strategy '((agenda habit-down user-defined-up time-up priority-down category-keep)
                                 (todo priority-down category-keep user-defined-up time-up)
                                 (tags priority-down category-keep user-defined-up time-up)
                                 (search category-keep))))

(evil-define-key 'motion org-agenda-mode-map
  "vd" 'org-agenda-day-view
  "ds" 'org-agenda-schedule
  "vw" 'org-agenda-week-view
  "vm" 'org-agenda-month-view
  "vy" 'org-agenda-year-view)

(after! org-agenda

(add-to-list 'org-agenda-custom-commands
             '("d" "Today" ((agenda "a"
                                    ((org-agenda-prefix-format "  %?-12t% s")
                                     (org-agenda-start-on-weekday nil)
                                     (org-agenda-span 1)
                                     (org-agenda-files (--map (concat org-directory "/" it) '("inbox.org" "home.org" "Work/work.org")))
                                     (org-agenda-start-day ".")
                                     (org-agenda-skip-scheduled-if-done t)
                                     (org-agenda-sorting-strategy '(timestamp-up time-up))
                                     (org-agenda-day-view)
                                     (org-super-agenda-groups '((:name "Today" :date today :time-grid t)
                                                                (:name "Overdue" :deadline past :scheduled past)
                                                                (:name "Future" :anything (:scheduled future)))))))))

(add-to-list 'org-agenda-custom-commands
             '("x" "Todo Items" alltodo ""
               ((org-agenda-prefix-format "  %?-12t% s")
                (org-agenda-sorting-strategy '(timestamp-down todo-state-down))
                (org-agenda-files (--map (concat org-directory "/" it) '("inbox.org" "home.org")))
                (org-super-agenda-groups '((:name "Next" :todo ("ACTIVE"))
                                           (:name "Scheduled" :scheduled t)
                                           (:name "Inbox" :file-path ".*inbox.org$" :order 2)
                                           (:name "Unscheduled" :and (:todo "TODO" :scheduled nil :not (:tag "BACKLOG")) :order 1)
                                           (:name "Backlog" :tag "BACKLOG" :order 3))))))

(add-to-list 'org-agenda-custom-commands
             '("e" "Emacs Items" alltodo ""
               ((org-agenda-prefix-format "  %?-12t% s")
                (org-agenda-sorting-strategy '(timestamp-down todo-state-down))
                (org-agenda-files (--map (concat org-directory "/" it) '("Emacs.org")))
                (org-super-agenda-groups '((:name "Active" :todo "ACTIVE")
                                           (:name "Next" :todo "NEXT")
                                           (:name "Low Effort" :effort< "0:30")
                                           (:name "Todo" :todo "TODO"))))))

(add-to-list 'org-agenda-custom-commands
             '("w" "Work Agenda"
               ((agenda "a" ((org-agenda-span 1)
                             (org-agenda-use-time-grid 'require-timed)
                             (org-agenda-start-day ".")))
                (tags-todo "+WORK-EVENT"
                   ((org-agenda-sorting-strategy '(timestamp-down time-down))
                    (org-super-agenda-groups '((:name "In Progress" :todo "ACTIVE")
                                               (:name "Coming Up Today" :scheduled today)
                                               (:name "Meta Work" :tag "META_WORK" :order 3)
                                               (:name "Reviews" :tag "REVIEW" :order 5)
                                               (:name "Tasks" :not (:todo "SOMEDAY" :todo "WAITING" :tag ("BACKLOG" "TEXT" "EMACS")) :order 4)
                                               (:name "Waiting" :todo "WAITING" :order 6)
                                               (:name "Backlog" :tag "BACKLOG" :order 11)
                                               (:name "Reading List" :tag "TEXT" :order 10))))))
               ((org-agenda-hide-tags-regexp "WORK\\|BACKLOG")
                (org-agenda-tag-filter-preset '("+WORK"))
                (org-agenda-files (--map (concat org-directory "/" it) '("Work/work.org" "inbox.org"))))))

(add-to-list 'org-agenda-custom-commands
             '("c" "Calendar" agenda ""
               ((org-agenda-span 7)
                (org-agenda-start-on-weekday nil)
                (org-agenda-start-day "-1d")
                (org-agenda-tag-filter-preset '("+CALENDAR")))))

:config
(setq org-agenda-files (list org-directory (concat org-directory "/Work"))))

(after! org
