config.org
*** Lookup Sources
#+BEGIN_SRC elisp
(setq +lookup-provider-url-alist
  '(("DuckDuckGo"        . "https://duckduckgo.com/?q=%s")
    ("DuckDuckGo Lucky"  . "https://duckduckgo.com/?q=\\%s")
    ("Github Code"       . "https://github.com/search?search&q=%s&type=Code")
    ("Google"            . "https://google.com/search?q=%s")
    ("Google images"     . "https://google.com/images?q=%s")
    ("Google maps"       . "https://maps.google.com/maps?q=%s")
    ("NPM"               . "https://npmjs.com/search?q=%s")
    ("Hoogle"            . "https://www.haskell.org/hoogle/?hoogle=%s")
    ("Project Gutenberg" . "http://www.gutenberg.org/ebooks/search/?query=%s")
    ("DevDocs.io"        . "https://devdocs.io/#q=%s")
    ("Explain Shell"     . "https://explainshell.com/explain?cmd=%s")
    ("StackOverflow"     . "https://stackoverflow.com/search?q=%s")
    ("Github"            . "https://github.com/search?ref=simplesearch&q=%s")
    ("Youtube"           . "https://youtube.com/results?aq=f&oq=&search_query=%s")
    ("Wolfram alpha"     . "https://wolframalpha.com/input/?i=%s")
    ("Wikipedia"         . "https://wikipedia.org/search-redirect.php?language=en&go=Go&search=%s")))
#+END_SRC
*** Bookmarks
#+BEGIN_SRC elisp
(setq bookmark-default-file "~/Dropbox/Temp/bookmarks")
#+END_SRC

*** Open OTF fonts in image mode
#+BEGIN_SRC elisp
(add-to-list 'auto-mode-alist '("\\.otf\\'" . image-mode))
#+END_SRC
*** Shorten Yes/No prompts
:PROPERTIES:
:SOURCE:   https://github.com/wasamasa/dotemacs/blob/master/init.org#shorten-yesno-prompts
:END:

Per default you're required to type out a full "yes" or "no" whenever
the function ~yes-or-no-p~ is invoked, let's substitute its function
definition to allow a "y" or "n" without even requiring confirmation.

#+BEGIN_SRC emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC
*** Fine undo
Whether actions like "cw" are undone in several steps.

#+BEGIN_SRC elisp
(setq evil-want-fine-undo t)
#+END_SRC
*** Move items to trash on delete
#+BEGIN_SRC elisp
(setq
 trash-directory "~/.Trash/"
 delete-by-moving-to-trash t)
#+END_SRC
*** Filename Auto Modes
Automatically set mode for specifc filenames

#+BEGIN_SRC elisp
;; auto-mode-alist
(add-to-list 'auto-mode-alist '("Brewfile" . shell-script-mode))
#+END_SRC
*** Terminal Config
Set the terminal to zsh

#+BEGIN_SRC elisp
;; Set the default multi-term to zsh
(setq multi-term-program "/bin/zsh")
#+END_SRC
*** Save Hist Mode
Save the command history between sessions
The history can be accessed with ~C-n~ / ~C-p~

#+BEGIN_SRC elisp
(savehist-mode 1)
#+END_SRC
*** Automatically reload tags files
#+BEGIN_SRC elisp
(setq tags-revert-without-query 1)
#+END_SRC
*** Disable trailng whitespace error
#+BEGIN_SRC elisp
(setq-hook! 'prog-mode-hook show-trailing-whitespace nil)
#+END_SRC
** Bindings
*** General Bindings
#+BEGIN_SRC elisp
(map! :en "C-卤" #'+popup/raise)
#+END_SRC
*** Osx / Mac Modifier Bindings
#+BEGIN_SRC elisp
(map!
 (:map override
   :gniv "s-w" #'+workspace/close-window-or-workspace
   :gniv "s-;" #'eval-expression
   :gniv "s-S" #'write-file
   :gniv "s-x" #'execute-extended-command

   ;; Workspace Switching
   :gniv "s-1" (位! (+workspace/switch-to 0))
   :gniv "s-2" (位! (+workspace/switch-to 1))
   :gniv "s-3" (位! (+workspace/switch-to 2))
   :gniv "s-4" (位! (+workspace/switch-to 3))
   :gniv "s-5" (位! (+workspace/switch-to 4))
   :gniv "s-6" (位! (+workspace/switch-to 5))
   :gniv "s-7" (位! (+workspace/switch-to 6))
   :gniv "s-8" (位! (+workspace/switch-to 7))
   :gniv "s-9" (位! (+workspace/switch-to 9))

   ;; Text scale
   :gniv "s-="   #'doom/increase-font-size
   :gniv "s--"   #'doom/decrease-font-size
   :gniv "s-0"   #'doom/reset-font-size))
#+END_SRC
*** Evil Normal Bindings
**** Window navigation
#+BEGIN_SRC elisp
(map!
 :en "C-h"   #'evil-window-left
 :en "C-j"   #'evil-window-down
 :en "C-k"   #'evil-window-up
 :en "C-l"   #'evil-window-right)
#+END_SRC
**** Replace With Register Motion
#+BEGIN_SRC elisp
(def-package! evil-replace-with-register
  :config
  (setq evil-replace-with-register-key (kbd "gr"))
  (define-key evil-normal-state-map
    evil-replace-with-register-key 'evil-replace-with-register)
  (define-key evil-visual-state-map
    evil-replace-with-register-key 'evil-replace-with-register))
#+END_SRC
**** Evil Quotes/Brackets Motion

Changes the text matching inside quotes with ~q~ motion (e.g. ~ciq~)
Change inner bracket with ~r~

#+BEGIN_SRC elisp
(after! evil
  (require 'evil-textobj-anyblock)
  (evil-define-text-object my-evil-textobj-anyblock-inner-quote
    (count &optional beg end type)
    "Select the closest outer quote."
    (let ((evil-textobj-anyblock-blocks
           '(("'" . "'")
             ("\"" . "\"")
             ("`" . "'")
             ("" . ""))))
      (evil-textobj-anyblock--make-textobj beg end type count nil)))

  (evil-define-text-object my-evil-textobj-anyblock-a-quote
    (count &optional beg end type)
    "Select the closest outer quote."
    (let ((evil-textobj-anyblock-blocks
           '(("'" . "'")
             ("\"" . "\"")
             ("`" . "'")
             ("" . ""))))
      (evil-textobj-anyblock--make-textobj beg end type count t)))

  (define-key evil-inner-text-objects-map "q" 'my-evil-textobj-anyblock-inner-quote)
  (define-key evil-outer-text-objects-map "q" 'my-evil-textobj-anyblock-a-quote)
  (define-key evil-inner-text-objects-map "r" 'evil-inner-bracket))
#+END_SRC
**** Go up one directory from the current buffer
#+BEGIN_SRC elisp
(after! evil
  (map! :m  "-"  #'dired-jump))
#+END_SRC
**** Fix history navigation for the minibuffer
#+BEGIN_SRC elisp
(define-key minibuffer-local-map "\C-p" 'previous-history-element)
(define-key minibuffer-local-map "\C-n" 'next-history-element)
#+END_SRC
**** Jump to last buffer
#+BEGIN_SRC elisp
(map! :n "gb" #'evil-switch-to-windows-last-buffer)
#+END_SRC
*** Evil Square Bracket Bindings

Global ~[~ & ~]~ combinator bindings

**** Dumb Jump
#+BEGIN_SRC elisp
(map!
 :n "]F" #'dumb-jump-go
 :n "[F" #'dumb-jump-back)
#+END_SRC
**** Flycheck Error Jumping
#+BEGIN_SRC elisp
(map!
 :n "]e" #'flycheck-next-error
 :n "[e" #'flycheck-previous-error)
#+END_SRC
*** Evil Insert Bindings

Insert Mode bindings, mostly unicode insertion and workaround for german umlaut.

**** Insert from the kill ring in insert mode

#+BEGIN_SRC elisp
(map! :i "A-y" #'helm-show-kill-ring)
#+END_SRC

**** Unicode Symbols and German Umlaut

#+BEGIN_SRC elisp
(map!
 :i "M-;"   (位! (insert "枚"))
 :i "M-:"   (位! (insert ""))
 :i "M-'"   (位! (insert "盲"))
 :i "M-\""  (位! (insert ""))
 :i "M-["   (位! (insert "眉"))
 :i "M-{"   (位! (insert ""))
 :i "M-s"   (位! (insert ""))
 :i "M-e"   (位! (insert ""))
 :i "M-`"   (位! (insert "掳"))
 :i "M-."   (位! (insert ""))
 :i "M-^"   (位! (insert "掳"))
 :i "M-l"   (位! (insert "位"))
 :i "M-w"   (位! (insert ""))
 :i "M-i"   (位! (insert "")))
#+END_SRC
***** TODO Inserting a character makes one undo state
*** Leader Bindings
#+BEGIN_SRC elisp
(map!
 :leader
 :n "'"  #'+popup/toggle
 :n "au" #'undo-tree-visualize
 :n "//" #'+default/search-project
 :n "-"  #'quick-calc

 (:desc "Toggle last iBuffer" :n "=" #'+popup/toggle))
#+END_SRC

**** Buffer
#+BEGIN_SRC elisp
(map!
 :leader
 (:desc "buffer" :prefix "b"
   :desc "Rename Buffer" :n "r" #'rename-buffer))
#+END_SRC
**** File
#+BEGIN_SRC elisp
(map!
 :leader
 (:desc "file" :prefix "f"
   :desc "find in literate config file" :n  "D" (位! (counsel-find-file (projectile-project-root)))
   :desc "find in literate config file" :n  "p" #'counsel-org-doom-config))
#+END_SRC
**** Dir
#+BEGIN_SRC elisp
(map!
 :leader
 (:desc "dir" :prefix "d"
   :desc "find in literate config file" :n  "r" #'dired-recent-open
   :desc "Project Root"                 :n  "p" #'projectile-dired))
#+END_SRC
**** Git
#+BEGIN_SRC elisp
(map!
 :leader
 (:desc "git" :prefix "g"
   :desc "Worktree Popup"              :n "%" #'magit-worktree
   :desc "Blame"                       :n "B" #'magit-blame
   :desc "Changed Files"               :n "F" #'+git|ivy-changed-files
   :desc "New Branch"                  :n "N" #'magit-branch-spinoff
   :desc "Show revision original File" :n "O" #'magit-revision-show-original-file
   :desc "Map-editor Changed Files"    :n "T" (位! (+git|ivy-changed-files "map-editor"))
   :desc "Amend Commit"                :n "a" #'magit-commit-amend
   :desc "Checkout"                    :n "b" #'magit-checkout
   :desc "Diff"                        :n "d" #'magit-diff
   :desc "Push"                        :n "p" #'magit-push
   :desc "Undo"                        :n "u" #'+git|undo))
#+END_SRC
**** Insert
#+BEGIN_SRC elisp
(map!
 :leader
 (:desc "insert" :prefix "i"
   :desc "Killring"   :n  "y" #'counsel-yank-pop))
#+END_SRC
**** Projects
#+BEGIN_SRC elisp
(map!
 :leader
 (:desc "project" :prefix "p"
   :desc "services" :n  "s" #'prodigy
   :desc "Workspace Project Files" :n  "P" #'+workspace|find-workspace-project-file))
#+END_SRC
**** Toggle
#+BEGIN_SRC elisp
(map!
 :leader
 (:desc "toggle" :prefix "t"
   :desc "Theme Dark/Light" :n  "t" #'+doom|toggle-theme))
#+END_SRC
**** Code
#+BEGIN_SRC elisp
(map!
 :leader
 (:desc "code" :prefix "c"
   :desc "Compile" "c" #'compile
   :desc "Compile" "Compile last command" (位! (compile (car compile-history)))))
#+END_SRC
