config.el

(setq +lookup-provider-url-alist
  '(("DuckDuckGo"        . "https://duckduckgo.com/?q=%s")
    ("DuckDuckGo Lucky"  . "https://duckduckgo.com/?q=\\%s")
    ("Github Code"       . "https://github.com/search?search&q=%s&type=Code")
    ("Google"            . "https://google.com/search?q=%s")
    ("Google images"     . "https://google.com/images?q=%s")
    ("Google maps"       . "https://maps.google.com/maps?q=%s")
    ("NPM"               . "https://npmjs.com/search?q=%s")
    ("Hoogle"            . "https://www.haskell.org/hoogle/?hoogle=%s")
    ("Project Gutenberg" . "http://www.gutenberg.org/ebooks/search/?query=%s")
    ("DevDocs.io"        . "https://devdocs.io/#q=%s")
    ("Explain Shell"     . "https://explainshell.com/explain?cmd=%s")
    ("StackOverflow"     . "https://stackoverflow.com/search?q=%s")
    ("Github"            . "https://github.com/search?ref=simplesearch&q=%s")
    ("Youtube"           . "https://youtube.com/results?aq=f&oq=&search_query=%s")
    ("Wolfram alpha"     . "https://wolframalpha.com/input/?i=%s")
    ("Wikipedia"         . "https://wikipedia.org/search-redirect.php?language=en&go=Go&search=%s")))

(setq bookmark-default-file "~/Dropbox/Temp/bookmarks")

(add-to-list 'auto-mode-alist '("\\.otf\\'" . image-mode))

(setq evil-want-fine-undo t)

(setq
 trash-directory "~/.Trash/"
 delete-by-moving-to-trash t)

;; auto-mode-alist
(add-to-list 'auto-mode-alist '("Brewfile" . shell-script-mode))

;; Set the default multi-term to zsh
(setq multi-term-program "/bin/zsh")

(savehist-mode 1)

(setq tags-revert-without-query 1)

(setq-hook! 'prog-mode-hook show-trailing-whitespace nil)

(map! :en "C-卤" #'+popup/raise)

(map!
 (:map override
   :gniv "s-w" #'+workspace/close-window-or-workspace
   :gniv "s-;" #'eval-expression
   :gniv "s-S" #'write-file
   :gniv "s-x" #'execute-extended-command

   ;; Workspace Switching
   :gniv "s-1" (位! (+workspace/switch-to 0))
   :gniv "s-2" (位! (+workspace/switch-to 1))
   :gniv "s-3" (位! (+workspace/switch-to 2))
   :gniv "s-4" (位! (+workspace/switch-to 3))
   :gniv "s-5" (位! (+workspace/switch-to 4))
   :gniv "s-6" (位! (+workspace/switch-to 5))
   :gniv "s-7" (位! (+workspace/switch-to 6))
   :gniv "s-8" (位! (+workspace/switch-to 7))
   :gniv "s-9" (位! (+workspace/switch-to 9))

   ;; Text scale
   :gniv "s-="   #'doom/increase-font-size
   :gniv "s--"   #'doom/decrease-font-size
   :gniv "s-0"   #'doom/reset-font-size))

(map!
 :en "C-h"   #'evil-window-left
 :en "C-j"   #'evil-window-down
 :en "C-k"   #'evil-window-up
 :en "C-l"   #'evil-window-right)

(def-package! evil-replace-with-register
  :config
  (setq evil-replace-with-register-key (kbd "gr"))
  (define-key evil-normal-state-map
    evil-replace-with-register-key 'evil-replace-with-register)
  (define-key evil-visual-state-map
    evil-replace-with-register-key 'evil-replace-with-register))

(after! evil
  (require 'evil-textobj-anyblock)
  (evil-define-text-object my-evil-textobj-anyblock-inner-quote
    (count &optional beg end type)
    "Select the closest outer quote."
    (let ((evil-textobj-anyblock-blocks
           '(("'" . "'")
             ("\"" . "\"")
             ("`" . "'")
             ("" . ""))))
      (evil-textobj-anyblock--make-textobj beg end type count nil)))

  (evil-define-text-object my-evil-textobj-anyblock-a-quote
    (count &optional beg end type)
    "Select the closest outer quote."
    (let ((evil-textobj-anyblock-blocks
           '(("'" . "'")
             ("\"" . "\"")
             ("`" . "'")
             ("" . ""))))
      (evil-textobj-anyblock--make-textobj beg end type count t)))

  (define-key evil-inner-text-objects-map "q" 'my-evil-textobj-anyblock-inner-quote)
  (define-key evil-outer-text-objects-map "q" 'my-evil-textobj-anyblock-a-quote)
  (define-key evil-inner-text-objects-map "r" 'evil-inner-bracket))

(after! evil
  (map! :m  "-"  #'dired-jump))

(define-key minibuffer-local-map "\C-p" 'previous-history-element)
(define-key minibuffer-local-map "\C-n" 'next-history-element)

(map! :n "gb" #'evil-switch-to-windows-last-buffer)

(map!
 :n "]F" #'dumb-jump-go
 :n "[F" #'dumb-jump-back)

(map!
 :n "]e" #'flycheck-next-error
 :n "[e" #'flycheck-previous-error)

(map! :i "A-y" #'helm-show-kill-ring)

(map!
 :i "M-;"   (位! (insert "枚"))
 :i "M-:"   (位! (insert ""))
 :i "M-'"   (位! (insert "盲"))
 :i "M-\""  (位! (insert ""))
 :i "M-["   (位! (insert "眉"))
 :i "M-{"   (位! (insert ""))
 :i "M-s"   (位! (insert ""))
 :i "M-e"   (位! (insert ""))
 :i "M-`"   (位! (insert "掳"))
 :i "M-."   (位! (insert ""))
 :i "M-^"   (位! (insert "掳"))
 :i "M-l"   (位! (insert "位"))
 :i "M-w"   (位! (insert ""))
 :i "M-i"   (位! (insert "")))

(map!
 :leader
 :n "'"  #'+popup/toggle
 :n "au" #'undo-tree-visualize
 :n "//" #'+default/search-project
 :n "-"  #'quick-calc

 (:desc "Toggle last iBuffer" :n "=" #'+popup/toggle))

(map!
 :leader
 (:desc "buffer" :prefix "b"
   :desc "Rename Buffer" :n "r" #'rename-buffer))

(map!
 :leader
 (:desc "file" :prefix "f"
   :desc "find in literate config file" :n  "D" (位! (counsel-find-file (projectile-project-root)))
   :desc "find in literate config file" :n  "p" #'counsel-org-doom-config))

(map!
 :leader
 (:desc "dir" :prefix "d"
   :desc "find in literate config file" :n  "r" #'dired-recent-open
   :desc "Project Root"                 :n  "p" #'projectile-dired))

(map!
 :leader
 (:desc "git" :prefix "g"
   :desc "Worktree Popup"              :n "%" #'magit-worktree
   :desc "Blame"                       :n "B" #'magit-blame
   :desc "Changed Files"               :n "F" #'+git|ivy-changed-files
   :desc "New Branch"                  :n "N" #'magit-branch-spinoff
   :desc "Show revision original File" :n "O" #'magit-revision-show-original-file
   :desc "Map-editor Changed Files"    :n "T" (位! (+git|ivy-changed-files "map-editor"))
   :desc "Amend Commit"                :n "a" #'magit-commit-amend
   :desc "Checkout"                    :n "b" #'magit-checkout
   :desc "Diff"                        :n "d" #'magit-diff
   :desc "Push"                        :n "p" #'magit-push
   :desc "Undo"                        :n "u" #'+git|undo))

(map!
 :leader
 (:desc "insert" :prefix "i"
   :desc "Killring"   :n  "y" #'counsel-yank-pop))

(map!
 :leader
 (:desc "project" :prefix "p"
   :desc "services" :n  "s" #'prodigy
   :desc "Workspace Project Files" :n  "P" #'+workspace|find-workspace-project-file))

(map!
 :leader
 (:desc "toggle" :prefix "t"
   :desc "Theme Dark/Light" :n  "t" #'+doom|toggle-theme))

(map!
 :leader
 (:desc "code" :prefix "c"
   :desc "Compile" "c" #'compile
   :desc "Compile" "Compile last command" (位! (compile (car compile-history)))))

(map!
 :leader
