config.org
**** Open
#+BEGIN_SRC elisp
(map!
 :leader
 (:desc "open" :prefix "o"
   :desc "Eshell in Current Dir" :n  "." (位! (+eshell/open t))
   :desc "Eshell Popup in Current Dir" :n  ">" (位! (+eshell/open t))))
#+END_SRC

**** Window
#+BEGIN_SRC elisp
(map!
 :leader
 (:desc "window" :prefix "w"
  :desc  "Split Vertical"   :n  "|"    #'evil-window-vsplit
  :desc  "Split Horizontal" :n  "_"    #'evil-window-split
  :desc  "Split Horizontal" :n  "_"    #'evil-window-split
  :desc  "Set Height"       :n  "C-_"    #'evil-window-set-height
  :desc  "Set Height"       :n  "C-|"    #'evil-window-set-width
  :desc  "Swap"             :n  "SPC"  #'ace-swap-window
  :desc "Toggle Locked" :n "#" #'toggle-window-dedicated))
#+END_SRC
**** Workspace
#+BEGIN_SRC elisp
(map!
 :leader
 (:desc "workspace" :prefix "<tab>"
   :desc "Switch to"    :n "." #'+workspace/my-switch-to
   :desc "Create"       :n "c" #'+workspace/new-named
   :desc "Rename"       :n "," #'+workspace/rename
   :desc "Last visited" :n "0" #'+workspace/switch-to-last-visited
   :desc "Clone"        :n "C" (位!
                                (+workspace/new (format "Clone: %s" (+workspace-current-name)) t)
                                (message "Cloned current workspace %s" (+workspace-current-name)))

   :desc "Display tab bar"          "TAB" #'+workspace/display
   :desc "New workspace"            "n"   #'+workspace/new
   :desc "Load workspace from file" "l"   #'+workspace/load
   :desc "Save workspace to file"   "s"   #'+workspace/save
   :desc "Switch workspace"         "."   #'+workspace/switch-to
   :desc "Delete session"           "x"   #'+workspace/kill-session
   :desc "Delete this workspace"    "d"   #'+workspace/delete
   :desc "Rename workspace"         "r"   #'+workspace/rename
   :desc "Restore last session"     "R"   #'+workspace/restore-last-session
   :desc "Next workspace"           "]"   #'+workspace/switch-right
   :desc "Previous workspace"       "["   #'+workspace/switch-left
   :desc "Switch to 1st workspace"  "1"   (位! (+workspace/switch-to 0))
   :desc "Switch to 2nd workspace"  "2"   (位! (+workspace/switch-to 1))
   :desc "Switch to 3rd workspace"  "3"   (位! (+workspace/switch-to 2))
   :desc "Switch to 4th workspace"  "4"   (位! (+workspace/switch-to 3))
   :desc "Switch to 5th workspace"  "5"   (位! (+workspace/switch-to 4))
   :desc "Switch to 6th workspace"  "6"   (位! (+workspace/switch-to 5))
   :desc "Switch to 7th workspace"  "7"   (位! (+workspace/switch-to 6))
   :desc "Switch to 8th workspace"  "8"   (位! (+workspace/switch-to 7))
   :desc "Switch to 9th workspace"  "9"   (位! (+workspace/switch-to 8))
   :desc "Switch to last workspace" "0"   #'+workspace/switch-to-last))
#+END_SRC

**** Yank
#+BEGIN_SRC elisp
(map!
  :leader
  (:desc "Yank" :prefix "y"
    :desc "filename"  :n  "f" (位! (copy-message (file-name-nondirectory buffer-file-name)))
    :desc "base"      :n  "b" (位! (copy-message (file-name-base (buffer-file-name))))
    :desc "directory" :n  "d" (位! (copy-message (file-name-directory (buffer-file-name))))
    :desc "path"      :n  "p" (位! (copy-message (file-name-directory (buffer-file-name))))
    :desc "project"   :n  "r" (位! (copy-message (s-replace (projectile-project-root) "" (buffer-file-name))))))
#+END_SRC

*** Little Word Motion
#+BEGIN_SRC elisp
(defun load-evil-camel-case-motion ()
  (require 'evil-little-word)
  (define-key evil-normal-state-map (kbd "M-w") 'evil-forward-little-word-begin)
  (define-key evil-normal-state-map (kbd "M-b") 'evil-backward-little-word-begin)
  (define-key evil-operator-state-map (kbd "M-w") 'evil-forward-little-word-begin)
  (define-key evil-operator-state-map (kbd "M-b") 'evil-backward-little-word-begin)
  (define-key evil-visual-state-map (kbd "M-w") 'evil-forward-little-word-begin)
  (define-key evil-visual-state-map (kbd "M-b") 'evil-backward-little-word-begin)
  (define-key evil-visual-state-map (kbd "i M-w") 'evil-inner-little-word))

(after! rjsx-mode
  (load-evil-camel-case-motion))

(after! reason-mode
  (load-evil-camel-case-motion))

(after! js2-mode
  (load-evil-camel-case-motion))
#+END_SRC
*** Package (Local-Leader) Bindings

Pacakge/Mode specific bindings

**** Org Mode
***** Local Leader Mapping
#+BEGIN_SRC elisp
(map! :map org-mode-map
      :localleader
      :desc  "Set source key to tab"    "k"  #'+org|source-properties-key-from-browser
      :desc  "Copy Buffer To Markdown"  "y"  #'+org|copy-buffer-as-markdown
      :desc  "Align Tags"               "%"  #'+org|align-all-tags
      :desc  "Goto Archive"             "$"  #'+org|visit-archive-file
      :desc  "Schedule Tomorrow"        "+"  #'+org|schedule-tomorrow
      (:prefix ("g" . "goto")
        :desc "Org Web Link" "l" #'+org-web-tools/read-url-at-point))
#+END_SRC
***** Meta Mapping
#+BEGIN_SRC elisp
(map! :niv "s-X" #'+org-capture/open-frame)

(map! :map org-mode-map
        :gni [s-return]   #'+org/insert-item-below
        :gni [s-S-return] #'+org/insert-item-above)

(map! :map outline-mode-map
      :n "s-k" #'org-metaup
      :n "s-j" #'org-metadown)
#+END_SRC
***** Agenda Mapping
****** Evil Customizations
#+BEGIN_SRC elisp
(defun my-evil-org-agenda-set-keys ()
  (evil-define-key 'motion org-agenda-mode-map
    "da" 'org-agenda-archive
    "dA" '+org|agenda-archive-and-done))

(advice-add #'evil-org-agenda-set-keys :after #'my-evil-org-agenda-set-keys)
#+END_SRC
****** Fix Window Navigation
#+BEGIN_SRC elisp
(map! :map org-agenda-mode-map
      :desc "Org Window Left" "C-h" #'evil-window-left
      :desc "Org Window Left" "C-l" #'evil-window-right)
#+END_SRC
**** Eshell
#+BEGIN_SRC elisp
(defun floscr|+eshell|init-keymap ()
  "Setup additional custom eshell keybindings to already existing doom bindings. This must be done in a hook because eshell-mode
redefines its keys every time `eshell-mode' is enabled."
  (map! :map eshell-mode-map
        :localleader "l" #'eshell/clear))
(add-hook 'eshell-first-time-mode-hook #'floscr|+eshell|init-keymap)
#+END_SRC
**** Elisp
#+BEGIN_SRC elisp
(map! :map emacs-lisp-mode-map
      ;; Rearrange Sexps
      :n "s-k"   (位! (sp-transpose-sexp)
                     (evil-previous-line))
      :n "s-j"   (位! (sp-push-hybrid-sexp)
                     (evil-next-line))

      ;; Eval Buffer
      :n "s-r" #'eval-buffer

      ;; Slurp and barf
      :n "g]"   #'sp-slurp-hybrid-sexp
      :n "g["   #'sp-forward-barf-sexp
      :localleader
      :desc  "Raise sexp" "<" #'raise-sexp
      :desc  "Barf Sexp" ">" #'barf-sexp)
#+END_SRC
*** Minibuffer Bindings
**** Copy and Paste from the minibuffer

Since the minibuffer has no evil mode, i've got these bindings to help out:
- ~M-c~: Copy the minibuffer line
- ~M-v~: Paste from clippboard to minibuffer (Same as ~C-r 0~)
         This also removes trailng newlines

#+BEGIN_SRC elisp
(defun evil-get-register-string (REGISTER)
  "Get evil-register pure text content
Registers can be selected with ?letter
E.g.: ?* -> Clipboard Contents"
  (evil-vector-to-string (evil-get-register REGISTER)))

(defun paste-evil-register-clipboard-pruned ()
  "Paste the current clipboard pruned from newlines"
  (interactive)
  (insert (s-trim (shell-command-to-string "pbpaste")))
  (doom/forward-to-last-non-comment-or-eol))

(defun copy-minibuffer-line ()
  "Copies the minibuffer content to the clipboard"
  (interactive)
  (save-excursion
    (doom/forward-to-last-non-comment-or-eol)
    (set-mark-command nil)
    (doom/backward-to-bol-or-indent)
    (kill-ring-save (mark) (point))))

(defun setup-minibuffer ()
  "Set up keybindings for the minibuffer"
  (local-set-key (kbd "s-v") 'paste-evil-register-clipboard-pruned)
  (local-set-key (kbd "s-c") 'copy-minibuffer-line))

(add-hook 'minibuffer-setup-hook 'setup-minibuffer)
#+END_SRC
